export const CHART_COLORS = [
  '#0088FE', // Яскраво-синій
  '#00C49F', // Смарагдовий
  '#FFBB28', // Сонячно-жовтий
  '#FF8042', // Помаранчевий
  '#8884d8', // Лавандовий
  '#005FB8', // Темно-синій
  '#22D3EE', // Ціановий
  '#10B981', // Зелений
  '#84CC16', // Лаймовий
  '#FACC15', // Золотистий
  '#F97316', // Насичений помаранчевий
  '#EF4444', // Червоний
  '#EC4899', // Рожевий
  '#D946EF', // Фуксія
  '#8B5CF6', // Фіолетовий
  '#6366F1', // Індиго
  '#475569', // Сталевий синій
  '#14B8A6', // Бірюзовий
  '#F43F5E', // Малиновий
  '#FB923C', // Світло-помаранчевий
  '#A855F7'  // Пурпуровий
];

export const API_BASE_URL = 'http://localhost:3001';

export const POLLING_INTERVAL = 1000; // ms
